FPS = 60  # кадры  в секунду

x = 200  # координата x игрока
y = 200  # координата y игрока

speed = 60  # скорость игрока
speed_rotation = 2 # скорость поворота игрока

lesser_hypo_of_va = 1527 * 100
semi_hypo_of_va = 1080 * 100
hypo_of_va = 2160 * 100

a = 0  # координата x левой вершины поля зрения
b = 0  # координата y левой вершины поля зрения

a1 = 0  # координата x правой вершины поля зрения
b1 = 0  # координата y правой вершины поля зрения

i = 0  # угол поворота левой границы поля зрения
i1 = 90  # угол поворота правой границы поля зрения
rotation_midle = 135  # угол поворота камеры (то что ты просил)
ll = 45
pp = 225
xch = [0, 0, 0]
ych = [0, 0, 0]
vision_r = 1400

a_projection = 0
b_projection = 0
h_fe = 0

n_z = 0

texture_size = [144, 144]